# Cask
tap "caskroom/cask"

# Bash
brew "bash"
brew "bash-completion"

# Coreutils
brew "coreutils"

# Git
brew "git"
brew "diff-so-fancy"
brew "icdiff"
brew "hub"
brew "tig"

# Neovim
tap "neovim/homebrew-neovim"
brew "neovim"

# Tmux
brew "tmux"
brew "reattach-to-user-namespace"

# Battery
tap "Goles/battery"
brew "battery"

# Tree
brew "tree"

# Fuck
brew "thefuck"

# Kermit for RPI
brew "c-kermit"

# Go
brew "go"
brew "hg"
brew "bzr"

# Python
brew "python3"

# Java
cask "java"

# Software
cask "iterm2"
cask "sublime-text"
cask "google-chrome"
cask "google-drive"
cask "flux"
cask "vlc"
cask "slack"

