# Bash & command line utilities
brew "bash"
brew "bash-completion"
brew "coreutils"
brew "thefuck"
brew "peco"

# Git
brew "git"
brew "diff-so-fancy"
brew "icdiff"
brew "hub"
brew "tig"
brew "lnav"

# Neovim
tap "neovim/homebrew-neovim"
brew "neovim"

# Tmux
brew "tmux"
brew "reattach-to-user-namespace"

# Battery
tap "Goles/battery"
brew "battery"

# Tree
brew "tree"

# Java
cask "java"

# Python
brew "python"
brew "python3"

# Go
brew "go"

# Mongodb
brew "mongodb"

# Lyft dependencies
brew "geos"
brew "protobuf"
brew "postgresql"
brew "libevent"
brew "pypy"
brew "openssl"
brew "spatialindex"
brew "mongo"
brew "awscli"
brew "aws-okta"

# Pre-commit linter
brew "pre-commit"

# Cask
tap "caskroom/cask"
cask "iterm2"
cask "sublime-text"
cask "google-chrome"
cask "flux"
cask "vlc"
cask "slack"
cask "jetbrains-toolbox"
cask "spotify"
cask "alfred"
cask "postman"
cask "virtualbox"
